{
  "/pages/flowchart/feelings": "Select and identify your emotions using the interactive feelings wheel. This helps you name what you're feeling so you can choose the right DBT skill.",
  "/pages/mindfulness/body-scan": "A guided body scan practice to help you notice physical sensations and connect them to emotions. Choose from 1, 5, or 15 minute options.",
  "/pages/mindfulness/body-scan/unsafe-body-check": "Safer alternatives to body scanning when internal focus feels unsafe. Includes grounding techniques and external anchors.",
  "/pages/flowchart/change": "Confirm whether you want to change your current feeling or sit with it. This helps you choose the right path forward.",
  "/pages/flowchart/changing-feelings": "A step-by-step guide to changing emotions when they don't fit the facts or are too intense. Includes self-care checks and emotion regulation skills.",
  "/pages/flowchart/sit-with-it": "Practice sitting with difficult emotions instead of avoiding them. Options include emotion exposure, self-validation, and self-compassion.",
  "/pages/flowchart/self-care": "Check in with your basic needs (hydration, medication, nourishment, rest) and get guidance on self-care tasks. Taking care of your body lowers emotional vulnerability.",
  "/pages/timer": "Set a timer to remind yourself to come back and check in. Useful when you need a break before continuing with skills.",
  "/pages/flowchart/gauge-overwhelm": "Assess whether you're feeling overwhelmed. This helps determine if you need distress tolerance skills or can move to emotion regulation.",
  "/pages/distress-tolerance/distress-tolerance": "Crisis survival skills for when emotions feel too big. Includes STOP, TIPP, ACCEPTS, and self-soothing techniques to get through difficult moments safely.",
  "/pages/flowchart/regulate": "Determine if you know what triggered your emotion. This helps you choose between checking the facts or addressing your reaction.",
  "/pages/flowchart/reaction": "Evaluate whether your emotional reaction fits the context of the situation. Helps you decide if you need to check the facts or can change the situation.",
  "/pages/flowchart/check-facts": "Separate observable facts from interpretations and assumptions. Helps you determine if your emotion fits the facts and choose the next skill.",
  "/pages/flowchart/change-situation": "Assess whether you can change the current situation. Helps you decide between problem-solving (if changeable) or self-soothing (if not).",
  "/pages/flowchart/problem-solve": "A structured approach to solving problems when your emotion fits the facts. Includes brainstorming solutions and taking action steps.",
  "/pages/flowchart/soothe": "Self-soothing techniques using the five senses to comfort your nervous system. Helps reduce distress when you can't change the situation.",
  "/pages/mindfulness/mindfulness": "Core mindfulness skills to help you notice what's happening right now without getting swept away. Includes observe, describe, and participate skills.",
  "/pages/mindfulness/meditation": "Various meditation techniques including loving-kindness, walking meditation, and neurodivergent-friendly approaches. Helps build present-moment awareness.",
  "/pages/mindfulness/body-scan": "Guided body scan practices to build body awareness and connect sensations to emotions. Available in 1, 5, and 15 minute options.",
  "/pages/mindfulness/awareness": "Practice radical acceptance through mindful awareness. Helps you notice reality as it is without fighting it.",
  "/pages/mindfulness/breathing": "Breathing exercises to help regulate your nervous system. Includes paced breathing and various techniques for different situations.",
  "/pages/mindfulness/wise-mind": "Find the balance between emotion mind and reasonable mind. Wise Mind helps you make effective decisions.",
  "/pages/mindfulness/what": "The 'What' skills of mindfulness: Observe, Describe, and Participate. Core actions for becoming present and aware.",
  "/pages/mindfulness/one-mindfulness": "Practice doing one thing at a time with full attention. Helps reduce overwhelm and increase effectiveness.",
  "/pages/distress-tolerance/stop": "STOP skill: Stop, Take a step back, Observe, Proceed mindfully. A quick crisis intervention to prevent impulsive actions.",
  "/pages/distress-tolerance/tip": "TIPP skill: Temperature, Intense exercise, Paced breathing, Paired muscle relaxation. Physically-based skills to reduce intense emotions quickly.",
  "/pages/distress-tolerance/accepts": "ACCEPTS skill: Activities, Contributing, Comparisons, Emotions (opposite), Pushing away, Thoughts, Sensations. Distraction techniques to get through difficult moments.",
  "/pages/distress-tolerance/improve": "IMPROVE skill: Imagery, Meaning, Prayer, Relaxation, One thing, Vacation, Encouragement. Ways to make difficult moments more bearable.",
  "/pages/distress-tolerance/radical-acceptance": "Accept reality as it is without fighting it. Reduces suffering by stopping the struggle against what cannot be changed.",
  "/pages/distress-tolerance/pros-cons": "Weigh the pros and cons of acting on an urge versus not acting. Helps you make wise decisions in crisis moments.",
  "/pages/distress-tolerance/cost-benefit": "Analyze the costs and benefits of different options. Helps you make effective choices when emotions are high.",
  "/pages/distress-tolerance/resistt": "RESISTT skill for urge-surfing without acting on impulses. Helps you ride out urges until they pass.",
  "/pages/distress-tolerance/effective-rethinking": "Reframe situations in ways that are more effective and less distressing. Helps shift perspective when stuck.",
  "/pages/distress-tolerance/muscle-relaxation": "Progressive muscle relaxation techniques to reduce physical tension and calm your nervous system.",
  "/pages/distress-tolerance/turning-mind": "Practice choosing acceptance repeatedly when your mind wants to fight reality. Helps maintain radical acceptance.",
  "/pages/distress-tolerance/willingness-half-smile": "Willingness: do what works even when you don't feel like it. Half-Smile: use your body to signal acceptance to your mind.",
  "/pages/distress-tolerance/nightmare-protocol": "DBT protocol for reducing nightmare intensity by rewriting endings and rehearsing safer versions while awake.",
  "/pages/emotional-regulation/emotional-regulation": "Overview of emotion regulation skills. Learn how emotions work and how to manage them effectively instead of being managed by them.",
  "/pages/emotional-regulation/opposite-action": "Act opposite to your emotion when it doesn't fit the facts. Helps change unwanted emotions by changing your behavior.",
  "/pages/emotional-regulation/build-mastery": "Build a sense of competence by doing one challenging thing daily. Helps reduce feelings of helplessness and increase self-efficacy.",
  "/pages/emotional-regulation/cope-ahead": "Rehearse skillful coping before a stressful situation. Practice runs for your nervous system to increase effectiveness.",
  "/pages/emotional-regulation/pleasant-activities": "Lists of pleasant activities organized by time and capacity. Helps you accumulate positive emotions and build a life worth living.",
  "/pages/emotional-regulation/letting-go": "Practice letting go of painful emotions that no longer serve you. Includes techniques for releasing emotional attachments.",
  "/pages/emotional-regulation/being-effective": "Focus on what works rather than what's fair or what proves a point. Helps you achieve your goals effectively.",
  "/pages/emotional-regulation/mental-noting": "Mental noting and thought defusion techniques. Label thoughts and emotions without getting swept away by them.",
  "/pages/emotional-regulation/cognitive-vulnerability": "Understand how thought patterns can make emotions hit harder. Learn to catch and reframe cognitive distortions.",
  "/pages/emotional-regulation/positive-self-talk": "Replace harsh self-criticism with balanced, compassionate self-talk. Helps reduce secondary emotions like shame.",
  "/pages/emotional-regulation/mindful-emotions": "Mindfulness of current emotion (ride the wave). Practice staying with intense feelings without suppressing or acting on them.",
  "/pages/emotional-regulation/abc-please": "ABC PLEASE: Accumulate positives, Build mastery, Cope ahead, and take care of your body (PLEASE). Reduces vulnerability and builds resilience.",
  "/pages/emotional-regulation/feel-in-body": "Use the emotion-sensation wheel to identify emotions through body awareness. Helps when you're not sure what you're feeling.",
  "/pages/interpersonal-skills/interpersonal-skills": "Overview of interpersonal effectiveness skills. Learn to communicate clearly, set boundaries, and maintain relationships while respecting yourself.",
  "/pages/interpersonal-skills/dear-man": "DEAR MAN: Describe, Express, Assert, Reinforce, stay Mindful, Appear confident, Negotiate. Get what you want while maintaining relationships.",
  "/pages/interpersonal-skills/give": "GIVE: Gentle, Interested, Validate, Easy manner. Maintain and improve relationships during difficult conversations.",
  "/pages/interpersonal-skills/fast": "FAST: Fair, (no) Apologies, Stick to values, Truthful. Maintain self-respect during difficult conversations.",
  "/pages/interpersonal-skills/interpersonal-intensity": "Determine how strongly to ask for something or say no. Match your intensity to the situation and your goals.",
  "/pages/interpersonal-skills/interpersonal-myths": "Common myths about relationships and communication. Learn what's actually effective versus what feels true.",
  "/pages/interpersonal-skills/communication-styles": "Identify your communication style (passive, aggressive, passive-aggressive, assertive). Learn to shift toward assertive communication.",
  "/pages/interpersonal-skills/assertiveness": "Practice assertive communication: expressing your needs clearly and respectfully while respecting others. The DBT 'sweet spot' between passivity and aggression.",
  "/pages/interpersonal-skills/conflict": "Navigate resistance and conflict effectively. Skills for handling disagreements and maintaining relationships during conflict.",
  "/pages/interpersonal-skills/ending-relationships": "Guidance on when and how to end relationships that are harmful or no longer serve you. Includes safety considerations.",
  "/pages/interpersonal-skills/interpersonal-mindfulness": "Practice mindfulness of others. Notice what's happening in relationships without getting swept away by assumptions or reactions.",
  "/pages/interpersonal-skills/finding-friends": "Practical strategies for building new friendships. Combines DBT interpersonal skills with step-by-step approaches to meeting people.",
  "/pages/crisis": "Crisis skills overview. Determine if you're overwhelmed and access immediate crisis survival skills like STOP, TIPP, and ACCEPTS.",
  "/pages/landing-page": "Return to the main landing page to explore all available DBT skills organized by module.",
  "/": "Return to the home page to start the interactive flowchart from the beginning.",
  "/pages/about": "Learn about DBT (Dialectical Behavior Therapy) and how these skills can help you manage emotions and build a life worth living.",
  "/pages/sleep-hygiene": "DBT sleep hygiene protocol to improve sleep quality. Includes neurodivergent-friendly accommodations and strategies for when you can't sleep."
}
